#include <stdio.h>

int main() {
    int n;			//ประกาศตัวแปรจำนวนเต็มชื่อ n
    printf("Enter number: ");		
    if(scanf("%d", &n) != 1 || n < 1) {		//รับค่าตัวเลขจากและตรวจสอบ
        printf("Error: Invalid input\n");
        return 1;
    }

    int i = n;		//ประกาศและกำหนดค่าตัวแปร i ให้เท่ากับ n
    if(n >= 2) {	//ตรวจสอบว่าค่าที่ผู้ใช้ป้อนมีค่ามากกว่าหรือเท่ากับ 2 หรือไม่
        do {		// เริ่ม ลูปชั้นนอก
            int isPrime = 1;		//ประกาศตัวแปรและกำหนดค่าเริ่มต้นเป็นจำนวนเฉพาะหรือไม่
            int j = 2;				//ประกาศและกำหนดค่าตัวแปร j ให้เท่ากับ 2
            do {					//เริ่ม ลูปชั้นใน
                if(j * j > i)		//ถ้า j ยกกำลังสองมีค่ามากกว่า i
                    break;			//ออกจากลูปชั้นในทันที
                if(i % j == 0) {	//ถ้า i หารด้วย j แล้วเหลือเศษ 0 หรือไม่
                    isPrime = 0;	//ระบุว่า i ไม่ใช่จำนวนเฉพาะ
                    break;			//ออกจากลูปชั้นในทันที
                }
                j++;				//เพิ่มค่า j ขึ้นทีละ 1 เพื่อตรวจสอบตัวหารตัวถัดไป
            } while(1);				//ลูปชั้นในจะทำงานไปเรื่อย ๆ อย่างไม่มีที่สิ้นสุด จนกว่าจะเจอคำสั่ง break

            if(isPrime)				//จะตรวจสอบค่า isPrime ถ้ายังมีค่าเป็น 1
                printf("%d ", i);	//แสดงตัวเลข i
            i--;					//ลดค่า i ลง 1 เพื่อตรวจสอบตัวเลขถัดไป
        } while(i >= 2);			//ลูปชั้นนอกจะทำงานต่อไปเรื่อย ๆ ตราบใดที่ i มีค่ามากกว่าหรือเท่ากับ 2
    }
    printf("\n");
    return 0;
}
